{
  "name": "Steven Ilan Merino Coral",
  "headshot": "static/images/2025-02-10_19h59m07s.png",
  "personal_information": {
    "phone": "+593 99 536 4075",
    "email": "steve_merino@proton.me",
    "linked_in": "https://www.linkedin.com/in/steven-merino-3453a0344",
    "github": "https://github.com/yuuhikaze",
    "website": "https://yuuhikaze.github.io",
    "languages": "Spanish (native), English (fluent), German (basic), Japanese (basic)"
  },
  "soft_skills": "Leadership, perseverance, teamwork, creativity, integrity, adaptability.",
  "hard_skills": [
    "Installation, configuration and maintenance of Debian or Arch based systems.",
    "Server hosting and management.",
    "Database infrastructure administration.",
    "Knowledgeable of design patterns, algorithms and clean code paradigms.",
    "Capable of building native and web applications.",
    "Proficient in media conceptualization, design and production."
  ],
  "experience": [
    {
      "description": "Infrastructure Intern at USFQ",
      "period": "2025/01–2025/07",
      "achievements": [
        "Zero-downtime migration to newer versions of Oracle Linux and clusterization of MariaDB databases, addressing obsolescence and ensuring platform reliability.",
        "Integration of CI/CD pipelines into projects developed by fellow interns, enhancing traceability and minimizing delivery friction.",
        "Creation of safeguards and processes to minimize operational errors, enhancing system safety."
      ]
    },
    {
      "description": "Infrastructure Consultant at USFQ",
      "period": "2025/08–2026/02",
      "achievements": [
        "Architected a production-grade hub-spoke Kubernetes infrastructure on Oracle Linux 9.x, implementing SNI-based HAProxy routing for multi-cluster API access and high-availability service delivery.",
        "Engineered a hybrid networking layer using Calico VXLAN to support seamless Linux and Windows worker node integration, coupled with Longhorn distributed storage to ensure data persistence and replication.",
        "Automated the end-to-end GitOps lifecycle using Ansible for cluster bootstrapping and ArgoCD for manifest orchestration, integrating OpenBao for secret management and Velero for S3-backed disaster recovery."
      ]
    }
  ],
  "education": [
    {
      "degree": "Bachelor’s degree in Computer Science",
      "institution": "Universidad San Francisco de Quito",
      "description": "Degree in progress.",
      "period": "2023-202?"
    }
  ],
  "certificates": null,
  "academic_interests": "Game development, simulations, data science, cybersecurity, computer graphics.",
  "personal_interests": "MMA, weightlifting, art, music production."
}
